MusaMahmood/nRF52_ADS1292_2CH_ECG/main.c
  nrf_clock_lf_cfg_t clock_lf_cfg = NRF_CLOCK_LFCLKSRC;

  // Initialize the SoftDevice handler module.
  SOFTDEVICE_HANDLER_INIT(&clock_lf_cfg, NULL);

  // Fetch the start address of the application RAM.
  uint32_t ram_start = 0;
  err_code = softdevice_app_ram_start_get(&ram_start);
  APP_ERROR_CHECK(err_code);

  // Overwrite some of the default configurations for the BLE stack.
  ble_cfg_t ble_cfg;

  // Configure number of custom UUIDS.
  memset(&ble_cfg, 0, sizeof(ble_cfg));
  ble_cfg.common_cfg.vs_uuid_cfg.vs_uuid_count = 1; //2?
  err_code = sd_ble_cfg_set(BLE_COMMON_CFG_VS_UUID, &ble_cfg, ram_start);
  APP_ERROR_CHECK(err_code);

  // Configure the maximum number of connections.
  memset(&ble_cfg, 0x00, sizeof(ble_cfg));
  ble_cfg.gap_cfg.role_count_cfg.periph_role_count = BLE_GAP_ROLE_COUNT_PERIPH_DEFAULT; //is 1
  ble_cfg.gap_cfg.role_count_cfg.central_role_count = 0;
  ble_cfg.gap_cfg.role_count_cfg.central_sec_count = 0;
  err_code = sd_ble_cfg_set(BLE_GAP_CFG_ROLE_COUNT, &ble_cfg, ram_start);
  APP_ERROR_CHECK(err_code);
  ///*
  // Configure the max ATT MTU?
  memset(&ble_cfg, 0x00, sizeof(ble_cfg));
  ble_cfg.conn_cfg.conn_cfg_tag = CONN_CFG_TAG;
  ble_cfg.conn_cfg.params.gatt_conn_cfg.att_mtu = NRF_BLE_GATT_MAX_MTU_SIZE;
  err_code = sd_ble_cfg_set(BLE_CONN_CFG_GATT, &ble_cfg, ram_start);
  APP_ERROR_CHECK(err_code);
  ///*
  // Configure the maximum event length
  memset(&ble_cfg, 0x00, sizeof(ble_cfg));
  ble_cfg.conn_cfg.conn_cfg_tag = CONN_CFG_TAG;
  ble_cfg.conn_cfg.params.gap_conn_cfg.event_length = 320;
  ble_cfg.conn_cfg.params.gap_conn_cfg.conn_count = BLE_GAP_CONN_COUNT_DEFAULT;
  err_code = sd_ble_cfg_set(BLE_CONN_CFG_GAP, &ble_cfg, ram_start);
  APP_ERROR_CHECK(err_code);

  // Configure the number of packets per connection event:
  memset(&ble_cfg, 0x00, sizeof(ble_cfg));
  ble_cfg.conn_cfg.conn_cfg_tag = CONN_CFG_TAG;
  ble_cfg.conn_cfg.params.gatts_conn_cfg.hvn_tx_queue_size = HVN_TX_QUEUE_SIZE;
  err_code = sd_ble_cfg_set(BLE_CONN_CFG_GATTS, &ble_cfg, ram_start);
  APP_ERROR_CHECK(err_code);

  //*/
  // Enable BLE stack.
  err_code = softdevice_enable(&ram_start);
  APP_ERROR_CHECK(err_code);

  // Register with the SoftDevice handler module for BLE events.
  err_code = softdevice_ble_evt_handler_set(ble_evt_dispatch);
  APP_ERROR_CHECK(err_code);

  // Register with the SoftDevice handler module for BLE events.
  err_code = softdevice_sys_evt_handler_set(sys_evt_dispatch);
  APP_ERROR_CHECK(err_code);
}

/**@brief Clear bond information from persistent storage.
 */
static void delete_bonds(void) {
  ret_code_t err_code = 0;

  NRF_LOG_INFO("Erase bonds!\r\n");

  //  err_code = pm_peers_delete();
  APP_ERROR_CHECK(err_code);
}

/**@brief Function for initializing the Advertising functionality.
 */
static void advertising_init(void) {
  ret_code_t err_code;
  ble_advdata_t advdata;
  ble_adv_modes_config_t options;

  // Build advertising data struct to pass into @ref ble_advertising_init.
  memset(&advdata, 0, sizeof(advdata));

  advdata.name_type = BLE_ADVDATA_FULL_NAME;
  advdata.include_appearance = true;
  advdata.flags = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;
  advdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
  advdata.uuids_complete.p_uuids = m_adv_uuids;

  memset(&options, 0, sizeof(options));
  options.ble_adv_fast_enabled = true;
  options.ble_adv_fast_interval = APP_ADV_INTERVAL;
  options.ble_adv_fast_timeout = APP_ADV_TIMEOUT_IN_SECONDS;

  err_code = ble_advertising_init(&advdata, NULL, &options, on_adv_evt, NULL);
  APP_ERROR_CHECK(err_code);
}

/**@brief Function for initializing the nrf log module.
 */
static void log_init(void) {
  ret_code_t err_code = NRF_LOG_INIT(NULL);
  APP_ERROR_CHECK(err_code);
}

/**@brief Function for the Power manager.
 */
static void power_manage(void) {
  ret_code_t err_code = sd_app_evt_wait();
  APP_ERROR_CHECK(err_code);
}

///*
static void advertising_start(void) {
  ble_gap_adv_params_t const adv_params =
      {
          .type = BLE_GAP_ADV_TYPE_ADV_IND,
          .p_peer_addr = NULL,
          .fp = BLE_GAP_ADV_FP_ANY,
          .interval = 300,
          .timeout = 0,
      };

  NRF_LOG_INFO("Starting advertising.\r\n");

  ret_code_t err_code = sd_ble_gap_adv_start(&adv_params, CONN_CFG_TAG);
  APP_ERROR_CHECK(err_code);
}

#if (defined(MPU60x0) || defined(MPU9150) || defined(MPU9250) || defined(MPU9255))
///*
//MPU9250;MPU9255
void mpu_setup(void) {
  ret_code_t ret_code;
  // Initiate MPU driver
  ret_code = mpu_init();
  APP_ERROR_CHECK(ret_code); // Check for errors in return value

  // Setup and configure the MPU with intial values
  mpu_config_t p_mpu_config = MPU_DEFAULT_CONFIG(); // Load default values
  p_mpu_config.smplrt_div = 19;                     // Change sampelrate. Sample Rate = Gyroscope Output Rate / (1 + SMPLRT_DIV). 19 gives a sample rate of 50Hz
  p_mpu_config.accel_config.afs_sel = AFS_16G;      // Set accelerometer full scale range to 2G
  ret_code = mpu_config(&p_mpu_config);             // Configure the MPU with above values
  APP_ERROR_CHECK(ret_code);                        // Check for errors in return value
}
//*/
#endif

void in_pin_handler(nrf_drv_gpiote_pin_t pin, nrf_gpiote_polarity_t action) {
  UNUSED_PARAMETER(pin);
  UNUSED_PARAMETER(action);
  if (m_connected) {
    get_eeg_voltage_array_2ch(&m_eeg);
  }
#if defined(APP_TIMER_SAMPLING) && APP_TIMER_SAMPLING == 1
  m_samples += 1;
#endif
  if (m_eeg.eeg_ch1_count == EEG_PACKET_LENGTH) {
    m_eeg.eeg_ch1_count = 0;
    ble_eeg_update_2ch(&m_eeg);
  }
}

static void ads1299_gpio_init(void) {
#if defined(BOARD_PCA10040) && LEDS_ENABLE == 1
  nrf_gpio_cfg_output(LED_1);
  nrf_gpio_cfg_output(LED_2);
  nrf_gpio_cfg_output(LED_3);
  nrf_gpio_cfg_output(LED_4);
  nrf_gpio_pin_set(LED_3);
  nrf_gpio_pin_set(LED_4);
#endif

#if defined(BOARD_NRF_BREAKOUT) | defined(BOARD_PCA10028) | defined(BOARD_PCA10040) | defined(BOARD_2CH_ECG_RAT)
  nrf_gpio_pin_dir_set(ADS1291_2_DRDY_PIN, NRF_GPIO_PIN_DIR_INPUT); //sets 'direction' = input/output
  nrf_gpio_pin_dir_set(ADS1291_2_PWDN_PIN, NRF_GPIO_PIN_DIR_OUTPUT);
#endif
#if defined(BOARD_2CH_ECG_RAT) && LEDS_ENABLE == 1
  nrf_gpio_cfg_output(LED_1);
  nrf_gpio_cfg_output(LED_2);
  nrf_gpio_pin_set(LED_1);
  nrf_gpio_pin_set(LED_2);
#endif
#ifdef BATTERY_LOAD_SWITCH_CTRL_PIN
  nrf_gpio_cfg_output(BATTERY_LOAD_SWITCH_CTRL_PIN);
  nrf_gpio_pin_set(BATTERY_LOAD_SWITCH_CTRL_PIN);
#endif
  uint32_t err_code;
  if (!nrf_drv_gpiote_is_init()) {
    err_code = nrf_drv_gpiote_init();
  }
  NRF_LOG_RAW_INFO(" nrf_drv_gpiote_init: %d\r\n", err_code);
  NRF_LOG_FLUSH();
  APP_ERROR_CHECK(err_code);
  bool is_high_accuracy = true;
  nrf_drv_gpiote_in_config_t in_config = GPIOTE_CONFIG_IN_SENSE_HITOLO(is_high_accuracy);
  in_config.is_watcher = true;
  in_config.pull = NRF_GPIO_PIN_NOPULL;
  err_code = nrf_drv_gpiote_in_init(ADS1291_2_DRDY_PIN, &in_config, in_pin_handler);
  NRF_LOG_RAW_INFO(" nrf_drv_gpiote_in_init: %d: \r\n", err_code);
  NRF_LOG_FLUSH();
  APP_ERROR_CHECK(err_code);
  nrf_drv_gpiote_in_event_enable(ADS1291_2_DRDY_PIN, true);
  ads1291_2_powerdn();
}

static void wait_for_event(void) {
  (void)sd_app_evt_wait();
}
/**@brief Function for application main entry.
 */
int main(void) {
  bool erase_bonds = false;
  uint32_t err_code = NRF_SUCCESS;
  // Initialize.
  log_init();
  timers_init();
  ble_stack_init();
  ads1299_gpio_init();
  gap_params_init();
  gatt_init();
  advertising_init();
  services_init();
  conn_params_init();
#if defined(ADS1292)
  //SPI STUFF FOR ADS:

  ads_spi_init_with_sample_freq(SPI_SCLK_WRITE_REG);
  nrf_delay_ms(5);
  // Stop continuous data conversion and initialize registers to default values
  ads1291_2_powerdn();
  ads1291_2_powerup();
  ads1291_2_stop_rdatac();

  ads1291_2_init_regs();

  ads1291_2_soft_start_conversion();
  ads1291_2_check_id();
  ads1291_2_start_rdatac();

  // Put AFE to sleep while we're not connected
  ads1291_2_standby();
  body_voltage_t body_voltage;
  nrf_delay_ms(10);
  m_eeg.eeg_ch1_count = 0;
#endif
#if (defined(MPU60x0) || defined(MPU9150) || defined(MPU9250) || defined(MPU9255))
  mpu_setup();
#endif
  // Start execution.
  application_timers_start();
  advertising_start();
  NRF_LOG_RAW_INFO(" BLE Advertising Start! \r\n");
  NRF_LOG_FLUSH();
#if LEDS_ENABLE == 1
  nrf_gpio_pin_clear(LED_2); // Green
  nrf_gpio_pin_set(LED_1);   //Blue
#endif
#if defined(APP_TIMER_SAMPLING) && APP_TIMER_SAMPLING == 1
  m_samples = 0;
#endif
// Enter main loop
#if NRF_LOG_ENABLED == 1
  for (;;) {
    if (!NRF_LOG_PROCESS()) {
      wait_for_event();
    }
  }
#endif
}

/**
 * @}
 */